<img src="http://imgur.com/1ZcRyrc.png" style="float: left; margin: 20px; height: 55px">

## Lab: Cleaning Rock Song Data

_Authors: Dave Yerrington (SF)_

---

In [3]:
import pandas as pd
import numpy as np 
import seaborn as sns

%matplotlib inline

### 1. Load `rock.csv` and do an initial examination of its data columns.

In [6]:
rockfile = "C:\\Users\\Greg\\DAT-course-materials-students-master\\lessons\\working-with-data\\rock.csv"

In [7]:
# Load the data.
rock = pd.read_csv(rockfile, sep=',')

In [9]:
# Look at the information regarding its columns.
rock.columns

Index(['Song Clean', 'ARTIST CLEAN', 'Release Year', 'COMBINED', 'First?',
       'Year?', 'PlayCount', 'F*G'],
      dtype='object')

### 2.  Clean up the column names.

Let's clean up the column names. There are two ways we can accomplish this:

#### 2.A Change the column names when you import the data using `pd.read_csv()`.

Notice that, when passing `names=[..A LIST OF STRING..]` with a number of columns that matches the number of strings in the passed list, you replace the column names.

NOTE: When you create custom column names, the first row of the `.csv` already represents a header. It is important to tell `pandas` to skip that row. The `skiprows=1` keyword argument to `read_csv()` will tell `pandas` to skip the first row.

In [16]:
# Change the column names when loading the '.csv':
rock_cols = ['song', 'artist', 'release_year', 'combined', 'first', 'year', 'play_count', 'f*g']

rock = pd.read_csv(rockfile, header=0, names=rock_cols)
rock.head()

,song,artist,release_year,combined,first,year,play_count,f*g
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

#### 2.B Change column names using the `.rename()` function.

The `.rename()` function takes an argument, `columns=name_dict`, in which `name_dict` is a dictionary containing the original column names as keys and the new column names as values.

In [17]:
# Change the column names using the `.rename()` function.
rock.rename(columns={'song':'song2', 'artist':'artist2', 'release_year':'release_year2', 'combined':'combined2', 'first':'first2', 'year':'year2', 'play_count':'play_count2', 'f*g':'f*g2'}, inplace=True)
rock.head()

,song2,artist2,release_year2,combined2,first2,year2,play_count2,f*g2
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

#### 2.C Reassigning the `.columns` attribute of a DataFrame.

You can also just reassign the `.columns` attribute to a list of strings containing the new column names. 

The only caveat with reassigning `.columns` is that you have to reassign all of the column names at once. You can't partially replace a value by working on `.columns` directly. You have to reassign `.columns` with a list of equal length.

In [19]:
# Replace the column names by reassigning the `.columns` attribute.
rock.columns = rock_cols
rock.head()

,song,artist,release_year,combined,first,year,play_count,f*g
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

### 3. Subsetting data where null values exist.

We have mixed `str` and `NaN` values in the `release` column. `NaN` stands for "not a number" and is the way `pandas` handles "nulls" or nonexistent data. We can use the `.isnull()` method of a Series to find null values.

Print the header of the data subset to where the `release` column is null values.

In [24]:
# Show records where df['release'] is null
rock[rock.release_year.isnull()].head()

,song,artist,release_year,combined,first,year,play_count,f*g
1,Fantasy Girl,.38 Special,NaN,Fantasy Girl by .38 Special,1,0,3,0
10,"Baby, Please Don't Go",AC/DC,NaN,"Baby, Please Don't Go by AC/DC",1,0,1,0
13,CAN'T STOP ROCK'N'ROLL,AC/DC,NaN,CAN'T STOP ROCK'N'ROLL by AC/DC,1,0,5,0
16,Girls Got Rhythm,AC/DC,NaN,Girls Got Rhythm by AC/DC,1,0,24,0
24,Let's Get It Up,AC/DC,NaN,Let's Get It Up by AC/DC,1,0,4,0

### 4. Update slices of your DataFrame based on mask selection/slices.

In many scenarios, we want to upate values in our DataFrame according to criteria. Let's say we wanted to set all of the null values in `release` to 0.

With newer versions of `pandas`, in order to manipulate data in the original DataFrame, we have to use `.loc` while performing reassignment using a mask and an index.

For example, the following won't always work:
```python
df[row_mask]['column_name'] = new_value
```

The best way to accomplish the same task is:
```python
df.loc[row_mask, 'column_name'] = new_value
```

For multiple column assignment, you would use:
```python
df.loc[row_mask, ['col_1', 'col_2', 'col_3']] = new_value
```

#### 4.A Let's try it out. Make all of the null values in `release` 0.

In [26]:
# Replace release nulls with 0
rock.loc[rock.release_year.isnull(), 'release_year'] = 0
rock.head()

,song,artist,release_year,combined,first,year,play_count,f*g
0,Caught Up in You,.38 Special,1982,Caught Up in You by .38 Special,1,1,82,82
1,Fantasy Girl,.38 Special,0,Fantasy Girl by .38 Special,1,0,3,0
2,Hold On Loosely,.38 Special,1981,Hold On Loosely by .38 Special,1,1,85,85
3,Rockin' Into the Night,.38 Special,1980,Rockin' Into the Night by .38 Special,1,1,18,18
4,Art For Arts Sake,10cc,1975,Art For Arts Sake by 10cc,1,1,1,1

#### 4.B Verify that `release` contains no null values.

In [27]:
# A:
rock[rock.release_year.isnull()].head()

Empty DataFrame
Columns: [song, artist, release_year, combined, first, year, play_count, f*g]
Index: []

### 5. Ensure that the data types of the columns make sense. 

Verifying column data types is a critical part of data munging. If columns have the wrong data type, then there is usually corrupted or incorrect data in some of the observations.

#### 5.A Look at the data types for the columns. Are any incorrect given what the data represents?

In [29]:
# A:
rock.dtypes

#release_year can be int64

song            object
artist          object
release_year    object
combined        object
first            int64
year             int64
play_count       int64
f*g              int64
dtype: object

### 6. Investigate and clean up the `release` column.

The `release` column is a string data type when it should be an integer.

#### 6.A Figure out what value(s) are causing the `release` column to be encoded as a string instead of an integer.

In [33]:
# A:
rock.dtypes

song            object
artist          object
release_year    object
combined        object
first            int64
year             int64
play_count       int64
f*g              int64
dtype: object

#### 6.B Look at the rows in which there is incorrect data in the `release` column.

In [57]:
# A:
rock[pd.to_numeric(rock['release_year'], errors='coerce').isnull()].head()

,song,artist,release_year,combined,first,year,play_count,f*g
1504,Bullfrog Blues,Rory Gallagher,SONGFACTS.COM,Bullfrog Blues by Rory Gallagher,1,1,1,1

#### 6.C. Clean up the data. Normally we may replace the offending data with null np.nan values, however we previously converted all of the nan values in the release column to zeros so we might as well continue with the same practice. Replacing with 0 (or nan) will allow us to convert the column to numeric.

In [59]:
# A:
rock.loc[pd.to_numeric(rock['release_year'], errors='coerce').isnull(), 'release_year'] = 0
rock[pd.to_numeric(rock['release_year'], errors='coerce').isnull()].head()

Empty DataFrame
Columns: [song, artist, release_year, combined, first, year, play_count, f*g]
Index: []

### 7. Get summary statistics for the `release` column using the `.describe()` function.

Now that the `release` column is finally a numeric data type, we can apply the `.describe()` function.  

#### 7.A Print out the summary stats for the `release` column. What is the earliest and latest release date?

In [73]:
# A:
rock.release_year.describe()
rock[rock['release_year'] != 0].release_year.sort_values().head(1)
rock[rock['release_year'] != 0].release_year.sort_values(ascending=False).head(1)

331    2014
Name: release_year, dtype: object

#### 7.B Based on the summary statistics, is there anything else wrong with the `release` column?

In [16]:
# A: Yes, there is a release_year of 1071

_Looking at the DataFrame that contains the year 1071, we can see that the year was probably corrupted and should be replaced with something else if possible._

### 8. Make changes and investigate using custom functions with `.apply()`.

Let's say we want to traverse every single row in our data set and apply a function to that row.

#### 8.A Write a function that will take a row of a DataFrame and print out the song, artist, and whether or not the release date is < 1970.

In [88]:
# A:
rock['releaseafter1970'] = rock.apply(lambda row: int(row.release_year) < 1970 and int(row.release_year) > 0, axis=1)
rock[['song', 'artist', 'release_year']][rock['releaseafter1970'] == True].head()

                              song       artist release_year
108            Don't Bring Me Down   Animals II         1966
109  Don't Let Me Be Misunderstood   Animals II         1965
148          Rock Around the Clock   Bill Haley         1955
195         Can't Find My Way Home  Blind Faith         1969
196           Presence of the Lord  Blind Faith         1969

#### 8.B Using the `.apply()` function, apply the function you wrote to the first four rows of the DataFrame.

You will need to tell the `apply` function to operate row by row. Setting the keyword argument as `axis=1` indicates that the function should be applied to each row individually.

In [89]:
# A:
rock[['song', 'artist', 'release_year']][rock['releaseafter1970'] == True].head(4)

                              song       artist release_year
108            Don't Bring Me Down   Animals II         1966
109  Don't Let Me Be Misunderstood   Animals II         1965
148          Rock Around the Clock   Bill Haley         1955
195         Can't Find My Way Home  Blind Faith         1969

You'll notice that there will be a final output Series of `None` values. The `.apply()` function, if a return value is not specified, will return a Series of `None` values (similar to how the default return for Python functions is `None` when a return statement is not specified).

### 9. Write a function that converts cells in a DataFrame to float and otherwise replaces them with `np.nan`.

If applied to our data, it would keep only the numeric information and otherwise input null values.

Recall that the try-except syntax in Python is a great way to try something and take another action if the initial step fails:

```python
try:
    Perform some action.
except:
   Perform some other action if the first failed with an error.
```

#### 9.A Write the function that takes a column and converts all of its values to float if possible and `np.nan` otherwise. The return value should be the converted Series.

In [94]:
# A:
try:
    # Perform some action.
    rock['song'] = rock['song'].astype('Float64')
except:
    rock['song'] = np.nan
    print('yikes')
    
rock

yikes

,song,artist,release_year,combined,first,year,play_count,f*g,releaseafter1970
0,NaN,.38 Special,1982.0,Caught Up in You by .38 Special,1,1,82,82,False
1,NaN,.38 Special,0.0,Fantasy Girl by .38 Special,1,0,3,0,False
2,NaN,.38 Special,1981.0,Hold On Loosely by .38 Special,1,1,85,85,False
3,NaN,.38 Special,1980.0,Rockin' Into the Night by .38 Special,1,1,18,18,False
4,NaN,10cc,1975.0,Art For Arts Sake by 10cc,1,1,1,1,False
...,...,...,...,...,...,...,...,...,...
2225,NaN,ZZ Top,0.0,She Loves My Automobile by ZZ Top,1,0,1,0,False
2226,NaN,ZZ Top,1981.0,Tube Snake Boogie by ZZ Top,1,1,32,32,False
2227,NaN,ZZ Top,1975.0,Tush by ZZ Top,1,1,109,109,False
2228,NaN,ZZ Top,1983.0,TV Dinners by ZZ Top,1,1,1,1,False
2229,NaN,ZZ Top,1973.0,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2,False

#### 9.B Try your function out on the rock song data and ensure the output is what you expected.

In [95]:
# A:
rock

,song,artist,release_year,combined,first,year,play_count,f*g,releaseafter1970
0,NaN,.38 Special,1982.0,Caught Up in You by .38 Special,1,1,82,82,False
1,NaN,.38 Special,0.0,Fantasy Girl by .38 Special,1,0,3,0,False
2,NaN,.38 Special,1981.0,Hold On Loosely by .38 Special,1,1,85,85,False
3,NaN,.38 Special,1980.0,Rockin' Into the Night by .38 Special,1,1,18,18,False
4,NaN,10cc,1975.0,Art For Arts Sake by 10cc,1,1,1,1,False
...,...,...,...,...,...,...,...,...,...
2225,NaN,ZZ Top,0.0,She Loves My Automobile by ZZ Top,1,0,1,0,False
2226,NaN,ZZ Top,1981.0,Tube Snake Boogie by ZZ Top,1,1,32,32,False
2227,NaN,ZZ Top,1975.0,Tush by ZZ Top,1,1,109,109,False
2228,NaN,ZZ Top,1983.0,TV Dinners by ZZ Top,1,1,1,1,False
2229,NaN,ZZ Top,1973.0,WAITIN' FOR THE BUS/JESUS JUST LEFT CHICAGO by...,1,1,2,2,False

#### 9.C Describe the new float-only DataFrame.

In [99]:
# A:
rock.release_year.describe()

count    2230.000000
mean     1465.331390
std       867.196161
min         0.000000
25%         0.000000
50%      1973.000000
75%      1981.000000
max      2014.000000
Name: release_year, dtype: float64